{
  "navbar": {
    "home": "Home",
    "services": "Services",
    "about": "About me",
    "resume": "Resume",
    "projects": "Projects"
  },
  "home": {
    "i'm": "Hi, I'm",
    "description": "Fullstack & Qlik Developer | Based in Spain",
    "talk": "Let's talk",
    "work": "My work",
    "cv": "Download my CV",
    "social-media": "My social media",
    "open": "Open to work"
  },
  "services": {
    "services": "Services",
    "specialties": "My specialties",
    "mobile": "Mobile apps",
    "databases": "Databases",
    "hello": "Say hello"
  },
  "about": {
    "i'm": "Hi, I'm",
    "description-1": "Ángel Pereira",
    "description-2": "Fullstack & Qlik Developer",
    "based": "Based in Spain",
    "experience": "2 years developing",
    "info": "I am a Spanish developer who creates applications that solve customer needs. I also have experience within the world of Business Intelligence.",
    "cv": "Download my CV here"
  },
  "resume": {
    "resume": "Resume",
    "details": "My details",
    "about": {
      "title": "About me",
      "subtitle": "Based in Spain",
      "description": "Ángel Manuel Pereira Rodríguez, Fullstack and Qlik developer, from Spain. I am a Spanish developer who creates applications that solve customer needs. I also have experience within the world of Business Intelligence.",
      "name": "Name",
      "nacionality": "Nacionality",
      "country": "Spain",
      "telephone": "Telephone",
      "email": "Email",
      "experience": "Experience",
      "experience-definition": "2 years developing",
      "languages": "Languages",
      "languages-definition": "Native Spanish, B2 English Cambridge"
    },
    "experience": {
      "title": "Experience",
      "first-experience-time": "11/2023 - now",
      "first-experience-title": "Fullstack developer",
      "second-experience-time": "03/2023 - 06/2023 · 4 months",
      "second-experience-title": "Qlik Sense Developer Intern"
    },
    "education": {
      "title": "Education",
      "hours": "hours",
      "ignacio": "San Ignacio Concerted Teaching Center - Cádiz, Spain"
    },
    "skills": {
      "title": "Skills"
    }
  },
  "projects": {
    "index-title": "My Recent Projects",
    "see-all": "See All Projects",
    "projects-title": "My Projects",
    "description": "Description",
    "technologies": "Technologies",
    "links": {
      "links": "Links",
      "github": "GitHub Link",
      "download": "Download App",
      "live": "Live Version",
      "see-all": "See All Projects",
      "principal": "Go to Main Page"
    },
    "project-1": {
      "line-1": "Client blog.",
      "line-2": "On the index screen you see the latest post.",
      "line-3": "There is also an archive with all available articles divided by categories and subcategories. There is also a search engine to find specific articles.",
      "line-4": "A music player is available where a song will play on loop."
    },
    "project-2": {
      "line-1": "The FrutyFest website, an event organized by ByFruty, a Twitch streamer and YouTuber, provides information about past and future editions of the event.",
      "line-2": "It features a table with selected participants and a ranking based on the scores obtained.",
      "line-3": "To participate, users must register and be selected by an administrator, who can also manage teams and game modes in the database.",
      "line-4": "During the event, administrators rate each game mode according to the established rules."
    },
    "project-3": {
      "line-1": "The project is an application that simplifies catalog management for companies and allows customers to place orders interactively.",
      "line-2": "For companies, it offers login and catalog management functions, viewing with filters, and managing customer suggestions.",
      "line-3": "Customers, after registration and validation, explore catalogs, manage a cart, give suggestions, and place orders with additional confirmation.",
      "line-4": "The administrator controls user management, company data, products, categories, suggestions, and orders, having total control over the application.",
      "line-5": "In summary, it improves interaction and efficiency in order management between companies and customers."
    },
    "project-4": {
      "line-1": "It is a website that has an administration and user system.",
      "line-2": "Users must register to access the content of the website.",
      "line-3": "The administrator is responsible for adding offers and articles.",
      "line-4": "Users can view the available offers and apply to them.",
      "line-5": "After applying, they have the option to generate a PDF with the offers they have applied to, which they can send by email or download directly."
    },
    "project-5": {
      "line-1": "It is a website that involves an administrator, teachers, and students.",
      "line-2": "Teachers have the ability to create news and evaluate students who are enrolled in their courses.",
      "line-3": "Students can enroll in any teacher's courses and view the corresponding grades."
    },
    "project-6": {
      "line-1": "It is a mobile application developed in Flutter that allows wholesale companies to add products to a database and assign prices to them.",
      "line-2": "In addition, retail companies can register as users to place orders with wholesale companies.",
      "line-3": "Laravel API created by a DAM professor (Abandoned).",
      "line-4": "Currently out of service."
    }
  },
  "footer": {
    "work": "Let's work together",
    "based": "Based in Spain",
    "developer": "Looking for a fullstack developer?",
    "in-depth": "Want a more in-depth look at my history?"
  }
}
