{
  "navbar": {
    "home": "Inicio",
    "services": "Servicios",
    "about": "Sobre mí",
    "resume": "Resumen",
    "projects": "Proyectos"
  },
  "home": {
    "i'm": "Hola, Soy",
    "description": "Desarrollador Fullstack y Qlik | Desde España",
    "talk": "Hablemos",
    "work": "Mis proyectos",
    "cv": "Descargar mi CV",
    "social-media": "Mis redes",
    "open": "Abierto para trabajar"
  },
  "services": {
    "services": "Servicios",
    "specialties": "Mis especialidades",
    "mobile": "Aplicaciones móviles",
    "databases": "Bases de datos",
    "hello": "Saluda"
  },
  "about": {
    "i'm": "Hola, soy",
    "description": "Ángel Pereira, desarrollador fullstack y Qlik",
    "based": "Desde España",
    "experience": "2 años realizando proyectos",
    "info": "Soy un desarrollador español que crea aplicaciones que resuelven necesidades de clientes. También tengo experiencia dentro del mundo de la Inteligencia de Negocio.",
    "cv": "Descarga mi CV aquí"
  },
  "resume": {
    "resume": "Resumen",
    "details": "Mis detalles",
    "about": {
      "title": "Sobre mí",
      "subtitle": "Desde España",
      "description": "Ángel Manuel Pereira Rodríguez, desarrollador Fullstack y Qlik, desde España. Soy un desarrollador español que crea aplicaciones que resuelven necesidades de clientes. También tengo experiencia dentro del mundo de la Inteligencia de Negocio.",
      "name": "Nombre",
      "nacionality": "Nacionalidad",
      "country": "España",
      "telephone": "Teléfono",
      "email": "Correo",
      "experience": "Experiencia",
      "experience-definition": "2 años haciendo proyectos",
      "languages": "Idiomas",
      "languages-definition": "Español nativo, Inglés B2 Cambridge"
    },
    "experience": {
      "title": "Experiencia",
      "first-experience-time": "11/2023 - actualidad",
      "first-experience-title": "Desarrollador Fullstack",
      "second-experience-time": "03/2023 - 06/2023 · 4 meses",
      "second-experience-title": "Desarrollador Qlik Sense en prácticas"
    },
    "education": {
      "title": "Educación",
      "hours": "horas",
      "ignacio": "Centro Concertado de Enseñanza San Ignacio - Cádiz, España"
    },
    "skills": {
      "title": "Habilidades"
    }
  },
  "projects": {
    "index-title": "Mis proyectos recientes",
    "see-all": "Ver todos los proyectos",
    "projects-title": "Mis proyectos",
    "description": "Descripción",
    "technologies": "Tecnologías",
    "links": {
      "links": "Enlaces",
      "github": "Enlace a Github",
      "download": "Descargar app",
      "live": "Versión Live",
      "see-all": "Ver todos los proyectos",
      "principal": "Ir a página principal"
    },
    "project-1": {
      "line-1": "La página web del FrutyFest, un evento organizado por ByFruty, streamer de Twitch y YouTuber, ofrece información sobre las ediciones pasadas y futuras del evento.",
      "line-2": "Presenta una tabla con los participantes seleccionados y un ranking basado en las puntuaciones obtenidas.",
      "line-3": "Para participar, los usuarios deben registrarse y ser seleccionados por un administrador, quien también puede gestionar equipos y modos de juego en la base de datos.",
      "line-4": "Durante el evento, los administradores califican cada modo de juego según las reglas establecidas."
    },
    "project-2": {
      "line-1": "El proyecto es una aplicación que simplifica la gestión de catálogos para empresas y permite a los clientes hacer pedidos de forma interactiva.",
      "line-2": "Para empresas, ofrece funciones de inicio de sesión y gestión de catálogo, visualización con filtros y gestión de sugerencias de clientes.",
      "line-3": "Los clientes, tras registro y validación, exploran catálogos, gestionan un carrito, dan sugerencias y generan pedidos con confirmación adicional.",
      "line-4": "El administrador controla la gestión de usuarios, datos de empresas, productos, categorías, sugerencias y pedidos, teniendo un control total sobre la aplicación.",
      "line-5": "En resumen, mejora la interacción y eficiencia en la gestión de pedidos entre empresas y clientes."
    },
    "project-3": {
      "line-1": "Se trata de una página web que cuenta con un sistema de administración y usuarios.",
      "line-2": "Los usuarios deben registrarse para acceder al contenido de la página.",
      "line-3": "El administrador tiene la responsabilidad de agregar ofertas y artículos.",
      "line-4": "Los usuarios pueden visualizar las ofertas disponibles y aplicar a ellas.",
      "line-5": "Después de aplicar, tienen la opción de generar un PDF con las ofertas a las que han aplicado, el cual pueden enviar por correo electrónico o descargar directamente."
    },
    "project-4": {
      "line-1": "Es una página web que involucra a un administrador, profesores y alumnos.",
      "line-2": "Los profesores tienen la capacidad de crear noticias y evaluar a los alumnos que están inscritos en sus asignaturas.",
      "line-3": "Los alumnos pueden inscribirse en las asignaturas de cualquier profesor y visualizar las calificaciones correspondientes."
    },
    "project-5": {
      "line-1": "Es una aplicación móvil desarrollada en Flutter que permite a empresas mayoristas agregar productos a una base de datos y asignarles precios.",
      "line-2": "Además, empresas minoristas pueden registrarse como usuarios para realizar pedidos a las empresas mayoristas.",
      "line-3": "API de Laravel realizada por un profesor de DAM (Abandonado).",
      "line-4": "Actualmente fuera de servicio."
    }
  },
  "footer": {
    "work": "Trabajemos juntos",
    "based": "Desde España",
    "developer": "¿Buscas a un desarrollador fullstack?",
    "in-depth": "¿Quieres conocerme en más profundidad?"
  }
}
